In [2]:
import pandas as pd

In [15]:
# Sample data
sales_data = [100, 90, 105, 115, 85, 88, 95, 80, 110, 120, 100, 105]

# Indices as tuples
index_tuples = [
    ('Laptops', 2020, 'USD'),
    ('Smartphones', 2020, 'EUR'),
    ('Headphones', 2020, 'GBP'),
    ('Laptops', 2021, 'USD'),
    ('Smartphones', 2021, 'EUR'),
    ('Headphones', 2021, 'GBP'),
    ('Laptops', 2022, 'USD'),
    ('Smartphones', 2022, 'EUR'),
    ('Headphones', 2022, 'JPY'),
    ('Laptops', 2023, 'USD'),
    ('Smartphones', 2023, 'JPY'),
    ('Headphones', 2023, 'GBP')
]

In [39]:
# Create a Series with a MultiIndex
series = pd.Series(sales_data, index=index_tuples)
series

(Laptops, 2020, USD)        100
(Smartphones, 2020, EUR)     90
(Headphones, 2020, GBP)     105
(Laptops, 2021, USD)        115
(Smartphones, 2021, EUR)     85
(Headphones, 2021, GBP)      88
(Laptops, 2022, USD)         95
(Smartphones, 2022, EUR)     80
(Headphones, 2022, JPY)     110
(Laptops, 2023, USD)        120
(Smartphones, 2023, JPY)    100
(Headphones, 2023, GBP)     105
dtype: int64

In [40]:
row_data = series[('Laptops', 2020, 'USD')]
print(row_data)

100

In [43]:
multiindex = pd.MultiIndex.from_tuples(index_tuples, names=['Product', 'Year', 'Currency'])

In [44]:
series = pd.Series(sales_data, index=multiindex)
series

Product      Year  Currency
Laptops      2020  USD         100
Smartphones  2020  EUR          90
Headphones   2020  GBP         105
Laptops      2021  USD         115
Smartphones  2021  EUR          85
Headphones   2021  GBP          88
Laptops      2022  USD          95
Smartphones  2022  EUR          80
Headphones   2022  JPY         110
Laptops      2023  USD         120
Smartphones  2023  JPY         100
Headphones   2023  GBP         105
dtype: int64

In [46]:
# Get all sales data for the year 2020
data_2020 = series[:, 2020, :]

data_2020

Product      Currency
Laptops      USD         100
Smartphones  EUR          90
Headphones   GBP         105
dtype: int64

In [50]:
# Get sales data for Smartphones across all years and currencies
Smartphones_sales = series['Smartphones']
Smartphones_sales

Year  Currency
2020  EUR          90
2021  EUR          85
2022  EUR          80
2023  JPY         100
dtype: int64

In [51]:
# Get all sales data for the currency 'EUR'
series.xs(key='EUR', level='Currency', axis=0)

Product      Year
Smartphones  2020    90
             2021    85
             2022    80
dtype: int64

In [57]:
sales_data = [100, 90, 105, 115]

# Separate lists
products = ['Smartphones', 'Laptops']
years = [2020, 2021]
currencies = ['USD', 'EUR']

# Create MultiIndex using `from_product`
index = pd.MultiIndex.from_product([products, years, currencies], names=['Product', 'Year', 'Currency'])

# Adjust the sales_data to fit the index size
series = pd.Series(sales_data * 2, index=index)

In [58]:
series

Product      Year  Currency
Smartphones  2020  USD         100
                   EUR          90
             2021  USD         105
                   EUR         115
Laptops      2020  USD         100
                   EUR          90
             2021  USD         105
                   EUR         115
dtype: int64

In [60]:
smartPhones_sales = series['Smartphones']
smartPhones_sales

Year  Currency
2020  USD         100
      EUR          90
2021  USD         105
      EUR         115
dtype: int64

In [62]:
# Sample data
data = [
    [100, 101, 102, 103],
    [90, 91, 92, 93],
    [105, 106, 107, 108],
    [115, 116, 117, 118]
]

# Separate lists for indices and columns
products = ['Smartphones', 'Laptops']
years = [2020, 2021]
currencies = ['USD', 'EUR', 'GBP', 'JPY']  # Added two more currencies to match the data columns

# Create row MultiIndex
row_index = pd.MultiIndex.from_product([products, years], names=['Product', 'Year'])

# Create a dataframe with the row MultiIndex and currency columns
df = pd.DataFrame(data, index=row_index, columns=currencies)

In [63]:
df

                  USD  EUR  GBP  JPY
Product     Year
Smartphones 2020  100  101  102  103
            2021   90   91   92   93
Laptops     2020  105  106  107  108
            2021  115  116  117  118

In [64]:
df.loc['Smartphones']

      USD  EUR  GBP  JPY
Year
2020  100  101  102  103
2021   90   91   92   93

In [65]:
df.loc[('Smartphones', 2020)]

USD    100
EUR    101
GBP    102
JPY    103
Name: (Smartphones, 2020), dtype: int64

In [66]:
df.loc[('Smartphones', 2020), 'USD']

100

In [67]:
df.loc[('Smartphones', slice(None)), :]

                  USD  EUR  GBP  JPY
Product     Year
Smartphones 2020  100  101  102  103
            2021   90   91   92   93

In [68]:
print(df['USD'])

Product      Year
Smartphones  2020    100
             2021     90
Laptops      2020    105
             2021    115
Name: USD, dtype: int64

In [70]:
# Sample data
data = {
    'Sales': [100, 90, 105, 115],
    'Returns': [5, 4, 8, 7]
}

# Index for the data
index = ['Smartphones', 'Laptops', 'Cameras', 'Tablets']

# Create a DataFrame
df = pd.DataFrame(data, index=index)
print("Original DataFrame:\n", df)

# Stack the DataFrame
stacked = df.stack()
print("\nStacked DataFrame:\n", stacked)

Original DataFrame:
              Sales  Returns
Smartphones    100        5
Laptops         90        4
Cameras        105        8
Tablets        115        7

Stacked DataFrame:
 Smartphones  Sales      100
             Returns      5
Laptops      Sales       90
             Returns      4
Cameras      Sales      105
             Returns      8
Tablets      Sales      115
             Returns      7
dtype: int64

In [ ]:
#Long and Wide

In [6]:
# Create a sample long-format DataFrame
data = {
    'Student': ['Alice', 'Bob', 'Alice', 'Bob'],
    'Subject': ['Math', 'Math', 'Science', 'Science'],
    'Score': [90, 88, 85, 92]
}

df_long = pd.DataFrame(data)
print("Long-format DataFrame:")
df_long

Long-format DataFrame:

  Student  Subject  Score
0   Alice     Math     90
1     Bob     Math     88
2   Alice  Science     85
3     Bob  Science     92

In [7]:
# Create a sample wide-format DataFrame
data_wide = {
    'Student': ['Alice', 'Bob'],
    'Math': [90, 88],
    'Science': [85, 92]
}

df_wide = pd.DataFrame(data_wide)
print("\nWide-format DataFrame:")
df_wide

Wide-format DataFrame:

  Student  Math  Science
0   Alice    90       85
1     Bob    88       92

In [ ]:
#stacking and Unstacking

In [3]:
# Creating the wide-format DataFrame
data_wide = {
    'Quarter': ['Q1', 'Q2'],
    'Product_A': [1000, 1100],
    'Product_B': [800, 820],
    'Product_C': [1200, 1300]
}

df_wide = pd.DataFrame(data_wide)

df_wide

  Quarter  Product_A  Product_B  Product_C
0      Q1       1000        800       1200
1      Q2       1100        820       1300

In [4]:
# Stacking (vertical transformation) the data
stacked_df = df_wide.set_index('Quarter').stack().reset_index(name='Sales')
print("Stacked DataFrame:")
stacked_df

Stacked DataFrame:

  Quarter    level_1  Sales
0      Q1  Product_A   1000
1      Q1  Product_B    800
2      Q1  Product_C   1200
3      Q2  Product_A   1100
4      Q2  Product_B    820
5      Q2  Product_C   1300

In [6]:
# Creating the long-format DataFrame
data_long = {
    'Month': ['January', 'January', 'February', 'February'],
    'City': ['New York', 'Boston', 'New York', 'Boston'],
    'Temperature': [32, 30, 35, 32]
}

df_long = pd.DataFrame(data_long)
df_long

      Month      City  Temperature
0   January  New York           32
1   January    Boston           30
2  February  New York           35
3  February    Boston           32

In [7]:

# Unstacking (horizontal transformation) the data
unstacked_df = df_long.set_index(['Month', 'City'])['Temperature'].unstack().reset_index()
print("\nUnstacked DataFrame:")
unstacked_df

Unstacked DataFrame:

City     Month  Boston  New York
0     February      32        35
1      January      30        32

In [9]:
# Creating a sample wide-format DataFrame
data_wide = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Temperature': [32, 30, 35],
    'Humidity': [45, 48, 42]
}

df_wide = pd.DataFrame(data_wide)

df_wide

         Date  Temperature  Humidity
0  2023-01-01           32        45
1  2023-01-02           30        48
2  2023-01-03           35        42

In [10]:
# Melting the time series data
melted_df = df_wide.melt(id_vars=['Date'], var_name='Variable', value_name='Value')

print("Melted Time Series DataFrame:")
melted_df

Melted Time Series DataFrame:

         Date     Variable  Value
0  2023-01-01  Temperature     32
1  2023-01-02  Temperature     30
2  2023-01-03  Temperature     35
3  2023-01-01     Humidity     45
4  2023-01-02     Humidity     48
5  2023-01-03     Humidity     42

In [12]:
# Creating a sample wide-format DataFrame
data_wide = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math_Score': [90, 88, 76],
    'Science_Score': [85, 92, 78],
}

df_wide = pd.DataFrame(data_wide)

# Melting the data
melted_df = df_wide.melt(id_vars=['ID', 'Name'], var_name='Subject', value_name='Score')
print("Melted DataFrame:")
print(melted_df)

Melted DataFrame:
   ID     Name        Subject  Score
0   1    Alice     Math_Score     90
1   2      Bob     Math_Score     88
2   3  Charlie     Math_Score     76
3   1    Alice  Science_Score     85
4   2      Bob  Science_Score     92
5   3  Charlie  Science_Score     78

In [11]:
# Creating a DataFrame with the original data

data = {
    'Student ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Courses': [['Math', 'Science'], ['History', 'Geography'], ['English']]
}

df = pd.DataFrame(data)

df

   Student ID     Name               Courses
0           1    Alice       [Math, Science]
1           2      Bob  [History, Geography]
2           3  Charlie             [English]

In [12]:
# Using explode to expand the 'Courses' column
exploded_df = df.explode('Courses', ignore_index=True)

print("Exploded DataFrame:")
exploded_df

Exploded DataFrame:

   Student ID     Name    Courses
0           1    Alice       Math
1           1    Alice    Science
2           2      Bob    History
3           2      Bob  Geography
4           3  Charlie    English

In [13]:
# Creating a sample DataFrame
data = {
    'Product Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
    'Sales Region': ['North', 'South', 'North', 'South'],
    'Revenue': [5000, 3000, 6000, 4000]
}

df = pd.DataFrame(data)
df

  Product Category Sales Region  Revenue
0      Electronics        North     5000
1         Clothing        South     3000
2      Electronics        North     6000
3         Clothing        South     4000

In [14]:
# Creating a pivot table to summarize revenue by category and region
pivot_table = pd.pivot_table(df, values='Revenue', index='Product Category', columns='Sales Region', 
                             aggfunc='sum', fill_value=0)

print("Pivot Table:")
pivot_table

Pivot Table:

Sales Region      North  South
Product Category
Clothing              0   7000
Electronics       11000      0

In [36]:
# Creating a sample DataFrame for sales data
data = {
    'Year': [2021, 2021, 2022, 2022],
    'Quarter': ['Q1', 'Q2', 'Q1', 'Q2'],
    'Product Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
    'Region': ['North', 'South', 'North', 'South'],
    'Revenue': [5000, 3000, 6000, 4000]
}

df = pd.DataFrame(data)

df

   Year Quarter Product Category Region  Revenue
0  2021      Q1      Electronics  North     5000
1  2021      Q2         Clothing  South     3000
2  2022      Q1      Electronics  North     6000
3  2022      Q2         Clothing  South     4000

In [35]:
# Creating a multi-index pivot table with hierarchical row and column indices
pivot_table = df.pivot_table(index=['Year', 'Quarter'], columns=['Product Category', 'Region'], values='Revenue', aggfunc='sum', fill_value=0)

print("Multi-Index Pivot Table:")
pivot_table

Multi-Index Pivot Table:

Product Category Clothing Electronics
Region              South       North
Year Quarter
2021 Q1                 0        5000
     Q2              3000           0
2022 Q1                 0        6000
     Q2              4000           0

In [39]:
# Creating a multi-index pivot table with hierarchical row and column indices
pivot_table = df.pivot_table(index=['Year', 'Quarter'], columns=['Product Category', 'Region'], 
                             values='Revenue', aggfunc='sum', fill_value=0)

print("Multi-Index Pivot Table:")
pivot_table

Multi-Index Pivot Table:

Product Category Clothing Electronics
Region              South       North
Year Quarter
2021 Q1                 0        5000
     Q2              3000           0
2022 Q1                 0        6000
     Q2              4000           0

In [42]:
# Creating a pivot table with hierarchical columns
pivot_table = df.pivot_table(index='Year', columns=['Product Category', 'Region'], 
                             values='Revenue', aggfunc='sum', fill_value=0)

print("hierarchical columns Pivot Table:")
pivot_table

hierarchical columns Pivot Table:

Product Category Clothing Electronics
Region              South       North
Year
2021                 3000        5000
2022                 4000        6000

In [45]:
# Creating a sample DataFrame for time series data (stock prices)
data = {
    'Date': pd.date_range(start='2023-01-01', periods=6, freq='D'),
    'Stock': ['AAPL', 'AAPL', 'AAPL', 'GOOGL', 'GOOGL', 'GOOGL'],
    'Price': [150.1, 151.2, 149.8, 2700.0, 2710.0, 2685.0]
}

df = pd.DataFrame(data)

df

        Date  Stock   Price
0 2023-01-01   AAPL   150.1
1 2023-01-02   AAPL   151.2
2 2023-01-03   AAPL   149.8
3 2023-01-04  GOOGL  2700.0
4 2023-01-05  GOOGL  2710.0
5 2023-01-06  GOOGL  2685.0

In [47]:
# Creating a pivot table for time series analysis (e.g., calculating monthly averages)
pivot_table = df.pivot_table(index=df['Date'].dt.month, columns='Stock', values='Price', aggfunc='mean')

print("Time Series Pivot Table (Monthly Averages):")
pivot_table

Time Series Pivot Table (Monthly Averages):

Stock        AAPL        GOOGL
Date
1      150.366667  2698.333333

In [ ]:
#Exercise questions

In [49]:
# Sample long-format DataFrame
data = {
    'Student': ['Alice', 'Alice', 'Bob', 'Bob', 'Charlie', 'Charlie'],
    'Year': [2021, 2022, 2021, 2022, 2021, 2022],
    'Subject': ['Math', 'Math', 'Math', 'Math', 'Math', 'Math'],
    'Score': [85, 88, 90, 92, 78, 82]
}

df_long = pd.DataFrame(data)

# Display the long-format DataFrame
print(df_long)

   Student  Year Subject  Score
0    Alice  2021    Math     85
1    Alice  2022    Math     88
2      Bob  2021    Math     90
3      Bob  2022    Math     92
4  Charlie  2021    Math     78
5  Charlie  2022    Math     82

In [50]:
data = {
    'Respondent': [1, 2, 3],
    'Responses': [
        ['Option A', 'Option B'],
        ['Option B'],
        ['Option A', 'Option C']
    ]
}

df_survey = pd.DataFrame(data)

df_survey

   Respondent             Responses
0           1  [Option A, Option B]
1           2            [Option B]
2           3  [Option A, Option C]

In [52]:
# Using Pandas 'explode' function to unnest the 'Responses' column
df_survey_exploded = df_survey.explode('Responses', ignore_index=True)

# Display the exploded DataFrame
df_survey_exploded

   Respondent Responses
0           1  Option A
1           1  Option B
2           2  Option B
3           3  Option A
4           3  Option C

In [54]:
data = {
    'Purchase Date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    'Product': ['A', 'B', 'A', 'C'],
    'Price': [50, 30, 45, 25]
}

df_purchases = pd.DataFrame(data)

df_purchases

  Purchase Date Product  Price
0    2022-01-01       A     50
1    2022-01-01       B     30
2    2022-01-02       A     45
3    2022-01-02       C     25

In [55]:
# Creating a pivot table to summarize total spending by product and purchase date
pivot_table = pd.pivot_table(df_purchases, values='Price', index='Product', columns='Purchase Date', aggfunc='sum', fill_value=0)

# Display the pivot table
print("Pivot Table for Summary Insights:")
pivot_table

Pivot Table for Summary Insights:

Purchase Date  2022-01-01  2022-01-02
Product
A                      50          45
B                      30           0
C                       0          25